# Pandas introduce
## Data Aggregtion and Group Operation

In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})

In [4]:
df

      data1     data2 key1 key2
0  1.080886  2.404806    a  one
1 -0.392537  0.810938    a  two
2  1.684569 -0.085758    b  one
3 -1.239409  0.273592    b  two
4 -0.474147  0.956597    a  one

In [5]:
df['sum']=1
df

      data1     data2 key1 key2  sum
0  1.080886  2.404806    a  one    1
1 -0.392537  0.810938    a  two    1
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1
4 -0.474147  0.956597    a  one    1

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [11]:
list(grouped)[0]

('a', 0    1.080886
 1   -0.392537
 4   -0.474147
 Name: data1, dtype: float64)

In [12]:
grouped.mean()

key1
a    0.07140
b    0.22258
Name: data1, dtype: float64

In [22]:
means = df['data2'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     1.680702
      two     0.810938
b     one    -0.085758
      two     0.273592
Name: data2, dtype: float64

unstack()重建key2索引

In [23]:
means.unstack()

key2       one       two
key1
a     1.680702  0.810938
b    -0.085758  0.273592

In [24]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [26]:
df['data1'].groupby([states, years]).mean().unstack()

                2005      2006
California -0.392537  1.684569
Ohio       -0.079262 -0.474147

Group 迭代

In [33]:
grouped = df.groupby(df['key1'])
pieces = dict(list(grouped))

In [31]:
for name, group in df.groupby(df['key1']):
    print(name)
    print(group)

a
      data1     data2 key1 key2  sum
0  1.080886  2.404806    a  one    1
1 -0.392537  0.810938    a  two    1
4 -0.474147  0.956597    a  one    1
b
      data1     data2 key1 key2  sum
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1

In [35]:
pieces['b']

      data1     data2 key1 key2  sum
2  1.684569 -0.085758    b  one    1
3 -1.239409  0.273592    b  two    1

syntacitc sugar

In [37]:
list(df.groupby('key1')['data1']) # df['data1'].groupby(df['key1'])

[('a', 0    1.080886
  1   -0.392537
  4   -0.474147
  Name: data1, dtype: float64), ('b', 2    1.684569
  3   -1.239409
  Name: data1, dtype: float64)]

In [6]:
ser = Series([2,1,4,3], index=['a','b','c','d'])

In [7]:
ser.values
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
list(map((lambda x:x**2),ser))

[4, 1, 16, 9]

passing a dict

In [11]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
ser1 = Series(sdata)
ser1

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [12]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
ser2 = Series(sdata, index=states)
ser2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [13]:
pd.isnull(ser2)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
ser3 = Series(np.array([[2,1],[4,3]]).reshape(-1), index= states)

In [20]:
ser3

California    2
Ohio          1
Oregon        4
Texas         3
dtype: int32

In [21]:
ser1+ser2

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [22]:
ser2.name = 'population'
ser2.index.name = 'state'

In [23]:
ser2

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

### DataFrame

In [4]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [5]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [6]:
frame2 = DataFrame(data, columns=['year','state','pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])

In [7]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [10]:
dict2 = dict(frame2.ix['three'])

In [11]:
dict2

{'debt': nan, 'pop': 3.6000000000000001, 'state': 'Ohio', 'year': 2002}

In [13]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [14]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [16]:
obj2.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [17]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [18]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object